In [2]:
%load_ext autoreload
%autoreload 2

In [3]:
import os
import sys
module_path = os.path.abspath(os.path.join(os.pardir, os.pardir))
if module_path not in sys.path:
    sys.path.append(module_path)

In [4]:
from src.data import data_collection

In [5]:
import psycopg2
import pandas as pd

In [6]:
DBNAME = "opportunity_youth"

In [7]:
conn = psycopg2.connect(dbname=DBNAME)

## OY IN PUMA

In [8]:
oy_df_per_puma = pd.read_sql("""
            SELECT puma, SUM(PWGTP) AS oy_in_puma
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY puma
            ;
            """, conn)
oy_df_per_puma

    puma  oy_in_puma
0  11610      1870.0
1  11611      2110.0
2  11612      2125.0
3  11613      2133.0
4  11614      1631.0
5  11615      1246.0

In [9]:
## what gender

In [10]:
oy_df_gender = pd.read_sql("""
            SELECT sex, SUM(PWGTP)
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY sex
            ;
            """, conn)
oy_df_gender

  sex     sum
0   1  5222.0
1   2  5893.0

In [11]:
## When last worked 

#1 .Within the past 12 months
#2 .1-5 years ago
#3 .Over 5 years ago or never worked

In [12]:
oy_df_wkl = pd.read_sql("""
            SELECT wkl, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY wkl
            ;
            """, conn)
oy_df_wkl

  wkl     sum
0   1  4491.0
1   2  2389.0
2   3  4235.0

In [13]:
#born in WA (only half)

In [14]:
oy_df_born_in_wa = pd.read_sql("""
            SELECT SUM(PWGTP)
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND POBP = '053'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            ;
            """, conn)
oy_df_born_in_wa

      sum
0  5312.0

In [15]:
#born in US (3/4)

In [16]:
oy_df_born_in_us = pd.read_sql("""
            SELECT SUM(PWGTP)
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND WAOB = '1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            ;
            """, conn)
oy_df_born_in_us

      sum
0  7676.0

In [17]:
#Have a child (5 percent)

In [44]:
oy_df_with_child = pd.read_sql("""
            SELECT SUM(PWGTP)
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND OC = '1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            ;
            """, conn)
oy_df_with_child

     sum
0  467.0

In [19]:
#nativity

In [20]:
oy_df_nativity = pd.read_sql("""
            SELECT nativity, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY nativity
            ;
            """, conn)
oy_df_nativity

  nativity     sum
0        1  8055.0
1        2  3060.0

In [21]:
#Top 5 Industries

#Restaurant/Retail/Construction

In [22]:
oy_df_industry = pd.read_sql("""
            SELECT INDP, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY INDP
            ORDER BY SUM(PWGTP) 
            DESC
            LIMIT 6
            ;
            """, conn)
oy_df_industry

   indp     sum
0  None  3678.0
1  8680  1217.0
2  9920   557.0
3  5380   458.0
4  0770   297.0
5  8660   262.0

In [23]:
#Degree Attained (Nothing Relevant)

In [24]:
oy_df_degree = pd.read_sql("""
            SELECT FOD1P, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY FOD1P
            ORDER BY SUM(PWGTP) 
            DESC
            LIMIT 6
            ;
            """, conn)
oy_df_degree

  fod1p      sum
0  None  10838.0
1  2601     47.0
2  6206     45.0
3  5506     36.0
4  6004     24.0
5  6201     24.0

In [25]:
#Married (15 percent married)

In [26]:
oy_df_married = pd.read_sql("""
            SELECT MAR, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY MAR
            ;
            """, conn)
oy_df_married

  mar     sum
0   1  1609.0
1   2    12.0
2   3    23.0
3   5  9471.0

In [27]:
#Military (Not relevant)

In [28]:
oy_df_military = pd.read_sql("""
            SELECT MIL, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY MIL
            ;
            """, conn)
oy_df_military

    mil      sum
0     2     49.0
1     3     16.0
2     4  10732.0
3  None    318.0

In [29]:
#Cognitive Difficulty (10 PERCENT HAVE PROBLEM)

In [30]:
oy_df_cog_prob = pd.read_sql("""
            SELECT DREM, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY DREM
            ;
            """, conn)
oy_df_cog_prob

  drem     sum
0    1  1216.0
1    2  9899.0

In [31]:
#SPEAK ENGLISH (6% HAVE PROBLEM WITH ENLGLISH)

In [33]:
oy_df_eng = pd.read_sql("""
            SELECT ENG, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY ENG
            ;
            """, conn)
oy_df_eng

    eng     sum
0     1  2863.0
1     2   863.0
2     3   442.0
3     4   185.0
4  None  6762.0

In [ ]:
#Citizenship (20% not US Citizen)

In [34]:
oy_df_cit = pd.read_sql("""
            SELECT CIT, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY CIT
            ;
            """, conn)
oy_df_cit

   cit     sum
0  1.0  7676.0
1  2.0   199.0
2  3.0   180.0
3  4.0   993.0
4  5.0  2067.0

In [83]:
not_oy_df = pd.read_sql("""
            SELECT SEX, SUM(PWGTP) 
            FROM pums_2017
            WHERE agep BETWEEN 16 AND 24
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY SEX
            ;
            """, conn)
not_oy_df

  sex      sum
0   1  45286.0
1   2  40597.0

In [79]:
oy_df_with_child = pd.read_sql("""
            SELECT schl, SUM(PWGTP) 
            FROM pums_2017
            WHERE esr!='1' AND esr!='4'
            AND sch='1'
            AND agep BETWEEN 16 AND 24
            AND schl = '11'
            AND puma IN ('11610','11611', '11612', '11613', '11614', '11615')
            GROUP BY schl
            ;
            """, conn)
oy_df_with_child

  schl    sum
0   11  233.0